const data = {
  "Австралія": "Канберра",
  "Австрія": "Відень",
  "Азербайджан": "Баку",
  "Албанія": "Тирана",
  "Алжир": "Алжир",
  "Ангола": "Луанда",
  "Андорра": "Андорра-ла-Велья",
  "Антигуа і Барбуда": "Сент-Джонс",
  "Аргентина": "Буенос-Айрес",
  "Афганістан": "Кабул",
  "Багамські Острови": "Нассау",
  "Багами": "Нассау",
  "Бангладеш": "Дакка",
  "Барбадос": "Бриджтаун",
  "Бахрейн": "Манама",
  "Беліз": "Бельмопан",
  "Бельгія": "Брюссель",
  "Бенін": "Порто-Ново",
  "Білорусь": "Мінськ",
  "Болгарія": "Софія",
  "Болівія": "Сукре",
  "Балівія": "Сукре",
  "Боснія і Герцеговина": "Сараєво",
  "Ботсвана": "Габороне",
  "Бразилія": "Бразілія",
  "Бруней": "Бандар-Сері-Бегаван",
  "Буркіна-Фасо": "Уагадугу",
  "Бурунді": "Гітега",
  "Бутан": "Тхімпху",
  "В'єтнам": "Ханой",
  "Вєтнам": "Ханой",
  "Вануату": "Порт-Віла",
  "Велика Британія": "Лондон",
  "Британія": "Лондон",
  "Англія": "Лондон",
  "Венесуела": "Каракас",
  "Вірменія": "Єреван",
  "Габон": "Лібревіль",
  "Гаїті": "Порт-о-Пренс",
  "Гамбія": "Банжул",
  "Гана": "Аккра",
  "Гаяна": "Джорджтаун",
  "Гватемала": "Гватемала",
  "Гвінея": "Конакрі",
  "Гвінея-Бісау": "Бісау",
  "Гондурас": "Тегусігальпа",
  "Гренада": "Сент-Джорджес",
  "Греція": "Афіни",
  "Грузія": "Тбілісі",
  "Данія": "Копенгаген",
  "Джибуті": "Джибуті",
  "Домініка": "Розо",
  "Домініканська Республіка": "Санто-Домінго",
  "ДР Конго": "Кіншаса",
  "Конго": "Кіншаса",
  "Демократична республіка Конго": "Кіншаса",
  "Еквадор": "Кіто",
  "Екваторіальна Гвінея": "Малабо",
  "Еритрея": "Асмара",
  "Есватіні": "Мбабане",
  "Естонія": "Таллінн",
  "Ефіопія": "Аддис-Абеба",
  "Єгипет": "Каїр",
  "Ємен": "Сана",
  "Египет": "Каїр",
  "Емен": "Сана",
  "Йемен": "Сана",
  "Замбія": "Лусака",
  "Зімбабве": "Хараре",
  "Ізраїль": "Єрусалим",
  "Ізраіль": "Єрусалим",
  "Індія": "Нью-Делі",
  "Індонезія": "Джакарта",
  "Ірак": "Багдад",
  "Іран": "Тегеран",
  "Ірландія": "Дублін",
  "Ісландія": "Рейк'явік",
  "Іспанія": "Мадрид",
  "Італія": "Рим",
  "Йорданія": "Амман",
  "Кабо-Верде": "Прая",
  "КабоВерде": "Прая",
  "Казахстан": "Нур-Султан",
  "Камбоджа": "Пномпень",
  "Камерун": "Яунде",
  "Канада": "Оттава",
  "Катар": "Доха",
  "Кенія": "Наїробі",
  "Киргизстан": "Бішкек",
  "Кіпр": "Нікосія",
  "Кипр": "Нікосія",
  "Кірибаті": "Тарава",
  "КНР": "Пекін",
  "Китай": "Пекін",
  "Колумбія": "Богота",
  "Коморські Острови": "Мороні",
  "Коста-Рика": "Сан-Хосе",
  "Кот-д'Івуар": "Ямусукро",
  "Коста Рика": "Сан-Хосе",
  "КотдІвуар": "Ямусукро",
  "Куба": "Гавана",
  "Кувейт": "Кувейт",
  "Лаос": "В'єнтьян",
  "Латвія": "Рига",
  "Лесото": "Масеру",
  "Литва": "Вільнюс",
  "Літва": "Вільнюс",
  "Ліберія": "Монровія",
  "Ліван": "Бейрут",
  "Лівія": "Тріполі",
  "Ліхтенштейн": "Вадуц",
  "Люксембург": "Люксембург",
  "М'янма": "Нейп'їдо",
  "Мянма": "Нейп'їдо",
  "Маврикій": "Порт-Луї",
  "Мавританія": "Нуакшот",
  "Мадагаскар": "Антананаріву",
  "Малаві": "Лілонгве",
  "Малайзія": "Куала-Лумпур",
  "Малі": "Бамако",
  "Мальдіви": "Мале",
  "Мальта": "Валлетта",
  "Марокко": "Рабат",
  "Маршаллові Острови": "Маджуро",
  "Мексика": "Мехіко",
  "Мозамбік": "Мапуту",
  "Молдова": "Кишинів",
  "Монако": "Монако",
  "Монголія": "Улан-Батор",
  "Намібія": "Віндгук",
  "Науру": "Ярен",
  "Непал": "Катманду",
  "Нігер": "Ніамей",
  "Нігерія": "Абуджа",
  "Нідерланди": "Амстердам",
  "Нікарагуа": "Манагуа",
  "Німеччина": "Берлін",
  "Нова Зеландія": "Веллінгтон",
  "Норвегія": "Осло",
  "ОАЕ": "Абу-Дабі",
  "Об'єднанні Арабські Емірати": "Абу-Дабі",
  "Обєднанні Арабські Емірати": "Абу-Дабі",
  "Арабські Емірати": "Абу-Дабі",
  "Емірати": "Абу-Дабі",
  "Оман": "Маскат",
  "Пакистан": "Ісламабад",
  "Палау": "Нгерулмуд",
  "Панама": "Панама",
  "Папуа Нова Гвінея": "Порт-Морсбі",
  "ПАР": "Преторія",
  "ПАР": "Преторія",
  "Парагвай": "Асунсьйон",
  "Перу": "Ліма",
  "Південна Корея": "Сеул",
  "Південний Судан": "Джуба",
  "Північна Корея": "Пхеньян",
  "Польща": "Варшава",
  "Португалія": "Лісабон",
  "Північна Македонія": "Скоп'є",
  "Македонія": "Скоп'є",
  "Республіка Конго": "Браззавіль",
  "Конго": "Браззавіль",
  "Росія": "Москва",
  "Руанда": "Кігалі",
  "Роанда": "Кігалі",
  "Раанда": "Кігалі",
  "Румунія": "Бухарест",
  "Сальвадор": "Сан-Сальвадор",
  "Самоа": "Апія",
  "Палестина": "Рамалла",
  "Сан-Марино": "Сан-Марино",
  "СанМарино": "Сан-Марино",
  "Сан Марино": "Сан-Марино",
  "Сан-Томе і Принсіпі": "Сан-Томе",
  "СанТоме і Принсіпі": "Сан-Томе",
  "Сан Томе і Принсіпі": "Сан-Томе",
  "Саудівська Аравія": "Ер-Ріяд",
  "Сейшельські Острови": "Вікторія",
  "Сенегал": "Дакар",
  "Сент-Вінсент і Гренадини": "Кінгстаун",
  "Сент-Кіттс і Невіс": "Бастер",
  "Сент-Люсія": "Кастрі",
  "Сербія": "Белград",
  "Сирія": "Дамаск",
  "Сінгапур": "Сінгапур",
  "Сингапур": "Сінгапур",
  "Словаччина": "Братислава",
  "Словенія": "Любляна",
  "Соломонові Острови": "Хоніара",
  "Сомалі": "Могадішо",
  "Судан": "Хартум",
  "Суринам": "Парамарібо",
  "Східний Тимор": "Ділі",
  "США": "Вашингтон",
  "Америка": "Вашингтон",
  "Сьєрра-Леоне": "Фрітаун",
  "Таджикистан": "Душанбе",
  "Таїланд": "Бангкок",
  "Таіланд": "Бангкок",
  "Тайланд": "Бангкок",
  "Танзанія": "Додома",
  "Того": "Ломе",
  "Тонга": "Нукуалофа",
  "Тринідад і Тобаго": "Порт-оф-Спейн",
  "Тувалу": "Фунафуті",
  "Тайвань": "Тайбей",
  "Туніс": "Туніс",
  "Туреччина": "Анкара",
  "Турція": "Анкара",
  "Туркменістан": "Ашгабат",
  "Уганда": "Кампала",
  "Угорщина": "Будапешт",
  "Узбекистан": "Ташкент",
  "Україна": "Київ",
  "Уругвай": "Монтевідео",
  "Федеративні Штати Мікронезії": "Палікір",
  "Мікронезія": "Палікір",
  "Фіджі": "Сува",
  "Філіппіни": "Маніла",
  "Фінляндія": "Гельсінкі",
  "Франція": "Париж",
  "Хорватія": "Загреб",
  "ЦАР": "Бангї",
  "Центральноафриканська Республіка": "Бангї",
  "Чад": "Нджамена",
  "Чехія": "Прага",
  "Чилі": "Сантьяго",
  "Чілі": "Сантьяго",
  "Чорногорія": "Подгориця",
  "Швейцарія": "Берн",
  "Швеція": "Стокгольм",
  "Шрі-Ланка": "Шрі-Джаяварденепура-Коте",
  "Шрі Ланка": "Шрі-Джаяварденепура-Коте",
  "Ямайка": "Кінгстон",
  "Японія": "Токіо"
};

const results = document.getElementById('results');
const inputField = document.getElementById('search');
const bt1 = document.getElementById('reset');

// Обработчик ввода
inputField.addEventListener('input', (event) => {
  const query = event.target.value.toLowerCase(); // Текст из поля ввода в нижнем регистре
  results.innerHTML = ''; // Очистить предыдущие результаты

  if (query) {
    // Фильтруем страны по введенному тексту
    Object.entries(data).forEach(([country, capital]) => {
      if (country.toLowerCase().startsWith(query)) {
        const countryRow = document.createElement('div');
        countryRow.classList.add('flex',"justify-between", 'px-2', 'space-y-1', 'align-left', 'items-center', 'space-x-2');
        const countrySpan = document.createElement('span');
        countrySpan.textContent = country;

        // Create a span for the capital and add bold styling
        const capitalSpan = document.createElement('span');
        capitalSpan.textContent = capital;
        capitalSpan.classList.add('font-bold', 'text-blue-950');

        // Append country span, dash span, and capital span to the container div
        countrySpan.classList.add('text-neutral-800', 'text-2xl', 'transform', 'transition', 'duration-100', 'hover:scale-125');
        capitalSpan.classList.add('text-neutral-800', 'text-2xl', 'transform', 'transition', 'duration-100', 'hover:scale-125');
        countryRow.appendChild(countrySpan);
        countryRow.appendChild(capitalSpan);

        // Append the container div to the li


        results.appendChild(countryRow);
      }
    });
  }
});

// Обработчик Ctrl + R для сброса
inputField.addEventListener('keydown', (event) => {
  if (event.ctrlKey && event.key === 'r') { // Проверка комбинации Ctrl + R
    event.preventDefault(); // Предотвращение стандартного действия (обновления страницы)
    inputField.value = ''; // Сброс ввода
    results.innerHTML = ''; // Очистка результатов поиска
    inputField.focus();
  }
});

// Обработчик для кнопки Reset
bt1.addEventListener('click', () => {
  inputField.value = ''; // Очистить поле ввода
  results.innerHTML = ''; // Очистить список результатов
  inputField.focus(); // Вернуть фокус на поле ввода
});

// Установить фокус на поле ввода при загрузке страницы
inputField.focus();

// Установить фокус на поле ввода при загрузке страницы
inputField.focus();
